# AnalysisDisplayColorSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayColorSettings Methods
AnalysisDisplayColorSettings Class See Also
---
The AnalysisDisplayColorSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreIntermediateColorsValid | Verify intermediate color entries |
| Colors | Get number of colors, including min, max and intermediate. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetIntermediateColors | Get intermediate color entries (other than the minimum and maximum settings). |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Compares two color settings objects. |
| SetIntermediateColors | Set intermediate color entries (other than the minimum and maximum settings). |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace